<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name':'John','age':25,'job':'student'},
    {'name':'Nate','age':30,'job':'teacher'}
]

데이터 프레임 생성

In [3]:
df = pd.DataFrame(friend_dict_list)

In [4]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [5]:
df = df[['name','age','job']]

In [6]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [7]:
from collections import OrderedDict

In [8]:
friend_ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [9]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [10]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [11]:
friend_list = [
    ['John',20,'student'],
    ['Nate',30,'teacher']
]

컬럼 네임 따로 지정하여 넣기

In [12]:
column_name = ['name','age','job']

In [13]:
df = pd.DataFrame.from_records(friend_list,columns=column_name)

In [14]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [15]:
friend_list = [
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]

In [16]:
from collections import OrderedDict

df =pd.DataFrame.from_dict(OrderedDict(friend_list))

In [17]:
df

   name  age      job
0  John   20  student
1  Nate   30  teacher